cayne-w/nrf52-keyboard/application/main/src/ble/ble_services.c
    case BLE_ADV_EVT_DIRECTED:
        break;

    case BLE_ADV_EVT_FAST:
        trig_event_param(USER_EVT_BLE_STATE_CHANGE, BLE_STATE_FAST_ADV);
        break;

    case BLE_ADV_EVT_SLOW:
        trig_event_param(USER_EVT_BLE_STATE_CHANGE, BLE_STATE_SLOW_ADV);
        break;

    case BLE_ADV_EVT_FAST_WHITELIST:
        trig_event_param(USER_EVT_BLE_STATE_CHANGE, BLE_STATE_FAST_ADV);
        break;

    case BLE_ADV_EVT_SLOW_WHITELIST:
        trig_event_param(USER_EVT_BLE_STATE_CHANGE, BLE_STATE_SLOW_ADV);
        break;

    case BLE_ADV_EVT_IDLE:
        trig_event_param(USER_EVT_BLE_STATE_CHANGE, BLE_STATE_IDLE);
        break;

    case BLE_ADV_EVT_WHITELIST_REQUEST: {
        ble_gap_addr_t whitelist_addrs[BLE_GAP_WHITELIST_ADDR_MAX_COUNT];
        ble_gap_irk_t whitelist_irks[BLE_GAP_WHITELIST_ADDR_MAX_COUNT];
        uint32_t addr_cnt = BLE_GAP_WHITELIST_ADDR_MAX_COUNT;
        uint32_t irk_cnt = BLE_GAP_WHITELIST_ADDR_MAX_COUNT;

        err_code = pm_whitelist_get(whitelist_addrs, &addr_cnt,
            whitelist_irks, &irk_cnt);
        APP_ERROR_CHECK(err_code);
        // Set the correct identities list (no excluding peers with no Central Address Resolution).
        identities_set(PM_PEER_ID_LIST_SKIP_NO_IRK);

        // Apply the whitelist.
        err_code = ble_advertising_whitelist_reply(&m_advertising,
            whitelist_addrs,
            addr_cnt,
            whitelist_irks,
            irk_cnt);
        APP_ERROR_CHECK(err_code);
    } break; //BLE_ADV_EVT_WHITELIST_REQUEST

    case BLE_ADV_EVT_PEER_ADDR_REQUEST: {
        pm_peer_data_bonding_t peer_bonding_data;

        // Only Give peer address if we have a handle to the bonded peer.
        if (m_peer_id != PM_PEER_ID_INVALID) {
            err_code = pm_peer_data_bonding_load(m_peer_id, &peer_bonding_data);
            if (err_code != NRF_ERROR_NOT_FOUND) {
                APP_ERROR_CHECK(err_code);

                // Manipulate identities to exclude peers with no Central Address Resolution.
                identities_set(PM_PEER_ID_LIST_SKIP_ALL);

                ble_gap_addr_t* p_peer_addr = &(peer_bonding_data.peer_ble_id.id_addr_info);
                err_code = ble_advertising_peer_addr_reply(&m_advertising, p_peer_addr);
                APP_ERROR_CHECK(err_code);
            }
        }
    } break; //BLE_ADV_EVT_PEER_ADDR_REQUEST

    default:
        break;
    }
}

/**
 * @brief 开始监测指定连接的 RSSI（诊断打点）。
 *
 * RSSI 每变化 >= 5dB 触发一次 BLE_GAP_EVT_RSSI_CHANGED，
 * 用于在 RTT 日志中观察每次断连前的信号强度趋势，判断是否为 RF 干扰/信号问题。
 *
 * @param conn_handle 连接句柄
 */
static void ble_rssi_monitor_start(uint16_t conn_handle)
{
    ret_code_t err_code = sd_ble_gap_rssi_start(conn_handle, 5, 5);
    if (err_code != NRF_SUCCESS && err_code != NRF_ERROR_INVALID_STATE) {
        xprintf("[BLE] t=%lums rssi_start failed err=%lu\n", ble_uptime_ms(), err_code);
    }
}

/**
 * @brief 停止监测指定连接的 RSSI
 *
 * @param conn_handle 连接句柄
 */
static void ble_rssi_monitor_stop(uint16_t conn_handle)
{
    (void)sd_ble_gap_rssi_stop(conn_handle);
}

//动态发射功率
#ifdef DYNAMIC_TX_POWER
static uint8_t current_tx = 3; // 0dbm 在 tx_power_table 中的下标。

/**
 * @brief RSSI 改变事件处理器（自动发射功率调整）
 *
 * @warning 原实现允许把发射功率一路降到 -40dBm：键盘贴近电脑时 RSSI 较强，
 *          每次 RSSI 波动都会继续降功率，极易使链路因信号过弱而掉线（监督超时）。
 *          这里将最低发射功率限制在 -12dBm，避免功率过低打穿连接。
 *
 * @param rssi 当前 RSSI
 */
static void ble_rssi_change(int8_t rssi)
{
    const int8_t tx_power_table[] = { -12, -8, -4, 0, 3, 4 };
    if (rssi >= -65 && current_tx > 0)
        current_tx--;
    else if (rssi <= -80 && current_tx < sizeof(tx_power_table) - 1)
        current_tx++;
    else
        return;

    ret_code_t err_code = sd_ble_gap_tx_power_set(BLE_GAP_TX_POWER_ROLE_CONN, m_conn_handle, tx_power_table[current_tx]);
    if (err_code != NRF_SUCCESS) {
        xprintf("[BLE] t=%lums tx_power_set err=%lu\n", ble_uptime_ms(), err_code);
    }
}
#endif

/**
 * @brief Function for handling BLE events.
 *
 * @param[in]   p_ble_evt   Bluetooth stack event.
 * @param[in]   p_context   Unused.
 */
static void ble_evt_handler(ble_evt_t const* p_ble_evt, void* p_context)
{
    ret_code_t err_code;

    switch (p_ble_evt->header.evt_id) {
    case BLE_GAP_EVT_CONNECTED: {
        uint16_t conn_handle = p_ble_evt->evt.gap_evt.conn_handle;
        if (!m_init_done) {
            sd_ble_gap_disconnect(conn_handle,
                                  BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            break;
        }
        m_conn_handle = conn_handle;
        err_code = nrf_ble_qwr_conn_handle_assign(&m_qwr, m_conn_handle);
        APP_ERROR_CHECK(err_code);
        ble_rssi_monitor_start(m_conn_handle);
        break;
    }

    case BLE_GAP_EVT_DISCONNECTED:
        ble_rssi_monitor_stop(p_ble_evt->evt.gap_evt.conn_handle);
        m_conn_handle = BLE_CONN_HANDLE_INVALID;

        if (on_disconnect_handler != NULL) {
            app_sched_event_put(NULL, 0, on_disconnect_handler);
            on_disconnect_handler = NULL;
        }

        trig_event_param(USER_EVT_BLE_STATE_CHANGE, BLE_STATE_DISCONNECT);
        break; // BLE_GAP_EVT_DISCONNECTED

    case BLE_GAP_EVT_CONN_PARAM_UPDATE:
        break;

    case BLE_GAP_EVT_CONN_PARAM_UPDATE_REQUEST:
        break;

    case BLE_GAP_EVT_PHY_UPDATE_REQUEST: {
        ble_gap_phys_t const phys = {
            .rx_phys = BLE_GAP_PHY_AUTO,
            .tx_phys = BLE_GAP_PHY_AUTO,
        };
        err_code = sd_ble_gap_phy_update(p_ble_evt->evt.gap_evt.conn_handle, &phys);
        if (err_code != NRF_SUCCESS) {
            xprintf("[BLE] PHY update reply failed: %d\n", err_code);
        }
        APP_ERROR_CHECK(err_code);
    } break;

    case BLE_GAP_EVT_PHY_UPDATE:
        break;

    case BLE_GAP_EVT_DATA_LENGTH_UPDATE_REQUEST:
        break;

    case BLE_GAP_EVT_DATA_LENGTH_UPDATE:
        break;

    case BLE_GAP_EVT_TIMEOUT:
        break;

    case BLE_GAP_EVT_SEC_PARAMS_REQUEST:
        break;

    case BLE_GAP_EVT_SEC_INFO_REQUEST:
        break;

    case BLE_GAP_EVT_SEC_REQUEST:
        break;

    case BLE_GAP_EVT_PASSKEY_DISPLAY:
        break;

    case BLE_GAP_EVT_AUTH_KEY_REQUEST:
        trig_event_param(USER_EVT_BLE_PASSKEY_STATE, PASSKEY_STATE_REQUIRE);
        break;

    case BLE_GAP_EVT_AUTH_STATUS:
        break;

